In [125]:
import pandas as pd
import re

In [105]:
df1 = pd.read_csv("dataset1.csv")
df2 = pd.read_csv("dataset2.csv")

Check for missing data

In [106]:
df1.isna().any()

name     False
price    False
dtype: bool

In [107]:
df2.isna().any()

name      True
price    False
dtype: bool

In [108]:
df2[df2["name"].isna()].head()

    name                     price
112  NaN  Mr. Manuel Mcfarland Jr.
128  NaN         Mr. Brian Bradley
200  NaN          Mr. Trevor Smith
224  NaN        Mr. Tracy Davis MD
740  NaN            Mr. Jake Ortiz

In [109]:
df1 = df1.dropna()
df2 = df2.dropna()

In [110]:
print(len(df1))
print(len(df2))

5000
4961

## Section 1: Data pipelines

Splitting `name` field to `first_name` and `last_name`

In [121]:
def get_fn(name):
    salutations = ["Mr.", "Mrs.", "Ms.", "Dr."]
    
    try: 
        name = name.strip()
        name = name.split()
        if name[0] in salutations:
            return name[1]
        else: 
            return name[0]
    except AttributeError:
        print(name)
        print(type(name))
    
def get_ln(name):
    name = name.strip()
    name = name.split()[-1]
    return name

In [122]:
df1["first_name"] = df1["name"].apply(get_fn)
df1["last_name"] = df1["name"].apply(get_ln)

df2["first_name"] = df2["name"].apply(get_fn)
df2["last_name"] = df2["name"].apply(get_ln)

In [123]:
df1

                name       price first_name last_name
0      William Dixon  109.037280    William     Dixon
1       Kristen Horn  262.524652    Kristen      Horn
2     Kimberly Chang  187.007258   Kimberly     Chang
3          Mary Ball  283.174648       Mary      Ball
4     Benjamin Craig  143.871582   Benjamin     Craig
...              ...         ...        ...       ...
4995  Shirley Nguyen    9.011665    Shirley    Nguyen
4996     Jesse Brown  247.328232      Jesse     Brown
4997   Valerie Owens  238.103714    Valerie     Owens
4998    Alicia Sharp  243.622929     Alicia     Sharp
4999   Sherry Jensen   13.839516     Sherry    Jensen

[5000 rows x 4 columns]

In [124]:
df2

                    name        price first_name  last_name
0         William Garcia  258.1809089    William     Garcia
1        Barbara Freeman   141.890534    Barbara    Freeman
2      Rebecca Zimmerman   293.373272    Rebecca  Zimmerman
3     Patricia Velasquez  249.9479246   Patricia  Velasquez
4           Ronnie Clark   272.908659     Ronnie      Clark
...                  ...          ...        ...        ...
4995        Rachel Davis  95.25395533     Rachel      Davis
4996     Connie Hamilton  205.3966853     Connie   Hamilton
4997         Sean Kaiser  80.54737145       Sean     Kaiser
4998     Ebony Rodriguez  93.20561606      Ebony  Rodriguez
4999     Gregg Alexander   297.046886      Gregg  Alexander

[4961 rows x 4 columns]

Check for prepended 0s in `price`

In [134]:
def removeLeadingZeros(price):
    
    # convert price to string 
    price = str(price)
    s = price
    
    # Regex to remove leading
    # zeros from a string
    regex = "^0+(?!$)"
 
    # Replaces the matched
    # value with given string
    s = re.sub(regex, "", s)
 
    return s

In [135]:
df1["price"] = df1["price"].apply(removeLeadingZeros)
df1["price"] = df1["price"].apply(removeLeadingZeros)

df2["price"] = df2["price"].apply(removeLeadingZeros)
df2["price"] = df2["price"].apply(removeLeadingZeros)

Create a field `above_100` for prices that are stricly greater than 100

In [141]:
df1["above_100"] = df1["price"].apply(lambda x: True if float(x)>100 else False)
df2["above_100"] = df2["price"].apply(lambda x: True if float(x)>100 else False)

Save new datasets

In [142]:
df1.to_csv("dataset1_processed.csv")
df2.to_csv("dataset2_processed.csv")